volume-coupled-transport/fluid-openfoam/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

x0 0.;
x1 6.;

y0 0.;
y1 2.;

z0 0;
z1 1;

vertices
(
    ($x0 $y0 $z0 )         // 0
    ($x1 $y0 $z0 )         // 1
    ($x0 $y1 $z0 )         // 2
    ($x1 $y1 $z0 )         // 3

    ($x0 $y0 $z1 )         // 4
    ($x1 $y0 $z1 )         // 5
    ($x0 $y1 $z1 )         // 6
    ($x1 $y1 $z1 )         // 7
);


// Grading
h1 60;
v1 20;

blocks
(
    hex (   0   1   3   2   4   5   7   6  )
    ($h1 $v1 1 )
    simpleGrading (1 1 1)

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (  0   2   6   4  )
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (  1   3   7   5  )
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (   2   3   7   6  )
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (   0   1   5   4  )
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (   0   1   3   2  )
            (   4   5   7   6  )
        );
    }
);
